window.menuLinks = function () {
  return {
    items: [
      {
        id: '1',
        href: '/about.html',
        text: 'О компании'
      },
      {
        id: '2',
        href: '/sale.html',
        text: 'Продажа'
      },
      {
        id: '3',
        href: '/lease.html',
        text: 'Аренда'
      },
      {
        id: '4',
        href: '/sale-parts.html',
        text: 'Продажа запчастей'
      },
      {
        id: '5',
        href: '/services.html',
        text: 'Сервисные услуги'
      },
      {
        id: '6',
        href: '/contacts.html',
        text: 'Контакты'
      },
    ],
  };
};

window.mainLinks = function () {
  return {
    items: [
      {
        id: '1',
        icon: 'tower_cranes',
        text: 'Новые GiraFFe'
      },
      {
        id: '2',
        icon: 'portal_cranes',
        text: 'Краны б/у'
      },
      {
        id: '3',
        icon: 'overhead_cranes',
        text: 'Узлы и запчасти'
      },
      {
        id: '4',
        icon: 'gantry_cranes',
        text: 'Монтаж'
      },
      {
        id: '5',
        icon: 'derrick_cranes',
        text: 'Импорт Liebherr'
      },
    ],
  };
};

window.shortServices = function () {
  return {
    items: [
      {
        id: '1',
        icon: 'ui_design',
        text: 'Проектирование'
      },
      {
        id: '2',
        icon: 'logistics',
        text: 'Доставка'
      },
      {
        id: '3',
        icon: 'easy_installation',
        text: 'Монтаж'
      },
      {
        id: '4',
        icon: 'repair',
        text: 'Обслуживание'
      },
      {
        id: '5',
        icon: 'consulting',
        text: 'Управление'
      },
      {
        id: '6',
        icon: 'portal_cranes',
        text: 'Наращивание'
      },
      {
        id: '7',
        icon: 'overhead_cranes',
        text: 'Демонтаж'
      },
      {
        id: '8',
        icon: 'trade_in',
        text: 'Вывоз'
      },
    ],
  };
};

window.services = function () {
  return {
    items: [
      {
        id: '1',
        icon: 'trade_in',
        title: 'Trade-in',
        text: 'Up Group предлагает услугу Trade-in, которая позволит вам обменять подержанный башенный кран на новый кран, с доплатой разницы в их стоимости. В рамках сотрудничества по системе Trade-in вы можете продолжать успешно развивать свой бизнес, меняя подержанный кран на новый — более эффективный и технологичный, и главное, необходимый вашей компании.'
      },
      {
        id: '2',
        icon: 'easy_installation',
        title: 'Монтаж и демонтаж крана',
        text: 'Помимо высокого уровня качества и надёжности строительной техники, основополагающим фактором безопасного и успешного хода строительства является квалифицированно произведенный монтаж башенных кранов. От точного исполнения требований инструкций, от уровня компетенций и опыта специалистов зависит безопасность, бесперебойность и долговечность эксплуатации крана. Мы оказываем полный комплекс услуг по монтажу башенных кранов'
      },
      {
        id: '3',
        icon: 'repair',
        title: 'Ремонт и обслуживание башенных кранов',
        text: 'Up Group предоставляет своим клиентам качественное обслуживание и ремонт башенных кранов. Несмотря на прочность, надежность и долговечность конструкции кранов, правила их эксплуатации предполагают проведение регулярного осмотра, а также, в случае необходимости, технического обслуживания и ремонта. Ремонт башенных кранов включает в себя не только непосредственную наладку основных узлов конструкции, но и диагностирование неисправностей, выявление их причины и сезонное обслуживание.'
      },
      {
        id: '4',
        icon: 'consulting',
        title: 'Консультационные услуги и инструктаж',
        text: 'Квалифицированные специалисты Up Group проводят инструктаж по системам управления, применяемым на башенных кранах Up Group. Срок обучения 3 календарных дня (теория, практика и зачёт). Большое внимание уделяется консультациям по наладке прибора безопасности, диагностике и исправлению неисправностей, электрической схемы кабины и сервисной/гарантийной поддержке.'
      },
      {
        id: '5',
        icon: 'ui_design',
        title: 'Проектирование',
        text: 'Проект производства работ кранами (ППРК) - это основной документ, регламентирующий производство работ с применением грузоподъёмных машин и съёмных грузозахватных приспособлений в соответствии с техническими правилами, требованиями к охране труда, экологической безопасности и качеству работ.'
      },
      {
        id: '6',
        icon: 'technical_support',
        title: 'Услуги крановщиков',
        text: 'Как предприятие полного цикла, особое внимание уделяющее вопросам сервисного облуживания, Up Group помимо прочих услуг предлагает своим клиентам услуги крановщиков.  Up Group насчитывает в составе компании более 150 высококвалифицированных машинистов башенных кранов с большим опытом работы.'
      },
      {
        id: '7',
        icon: 'logistics',
        title: 'Доставка',
        text: 'Мы готовы поставить краны Up Group в любую точку России и мира.  Для удобства заказчиков мы готовы разработать индивидуальный способ доставки груза железнодорожным и автомобильным транспортом. Размеры и масса автомобилей соответствуют транспортному габариту. Также возможно привлечение водного транспорта.'
      },
    ],
  };
};
